#include <Windows.h>
#include <CommCtrl.h>
#include "memory.h"
#include <locale>
#include <codecvt>
#include <TlHelp32.h>
#include <random>
#include <string>

#pragma comment(lib,"Comctl32.lib")
#pragma comment(linker,"\"/manifestdependency:type='win32' \
name='Microsoft.Windows.Common-Controls' version='6.0.0.0' \
processorArchitecture='*' publicKeyToken='6595b64144ccf1df' language='*'\"")

#define WINRPM
#ifndef SINGLETHREADED
#pragma omp
#endif

ULONG_PTR GNames = NULL;
ULONG_PTR GWorld = NULL;
ULONG_PTR GObjects = NULL;
ULONG_PTR baseModule = NULL;
ULONG_PTR baseSize = NULL;
HANDLE hProcess;
uintptr_t PID = 0;

BOOL WINAPI ReadProcessMemoryCallback(_In_ HANDLE hProcess, _In_ LPCVOID lpBaseAddress, LPVOID lpBuffer, _In_ SIZE_T nSize, _Out_opt_ SIZE_T * lpNumberOfBytesRead)
{

    BOOL bRet = ReadProcessMemory(hProcess, lpBaseAddress, lpBuffer, nSize, lpNumberOfBytesRead);

    //printf("processhandle is %p - ret: %d.\n", hProcess, bRet);

    return bRet;
}

HWND GetPUBGWindowProcessId(__out LPDWORD lpdwProcessId)
{
    HWND hWnd = FindWindowA(NULL, "Sea of Thieves");
    if (hWnd != NULL)
    {
        if (!GetWindowThreadProcessId(hWnd, lpdwProcessId))
            return NULL;
    }
    return hWnd;
}
#include <Psapi.h>
HMODULE GetModuleBaseAddress(HANDLE handle) {
    HMODULE hMods[1024];
    DWORD   cbNeeded;

    if (EnumProcessModules(handle, hMods, sizeof(hMods), &cbNeeded)) {
    return hMods[0];
    }
    return NULL;
}

HANDLE Process(const char* ProcessName)
{

    PROCESSENTRY32 ProcEntry;
    ProcEntry.dwSize = sizeof(ProcEntry);
    do
        if (!strcmp(ProcEntry.szExeFile, ProcessName))
        {
            PID = ProcEntry.th32ProcessID;
            CloseHandle(hPID);
            return hProcess = OpenProcess(PROCESS_ALL_ACCESS, FALSE, PID);
        }
    while (Process32Next(hPID, &ProcEntry));
}

bool DataCompare(BYTE* data, BYTE* sign, char* mask)
{
    for (; *mask; mask++, sign++, data++)
    {
        if (*mask == 'x' && *data != *sign)
        {
            return false;
        }
    }
    return true;
}

uintptr_t FindSignature(uintptr_t base, uintptr_t size, BYTE* sign, char* mask)
{
    MEMORY_BASIC_INFORMATION mbi = { 0 };
    uintptr_t offset = 0;
    while (offset < size)
    {
        VirtualQueryEx(hProcess, (LPCVOID)(base + offset), &mbi, sizeof(MEMORY_BASIC_INFORMATION));
        if (mbi.State != MEM_FREE)
        {
            BYTE* buffer = new BYTE[mbi.RegionSize];
            ReadProcessMemory(hProcess, mbi.BaseAddress, buffer, mbi.RegionSize, NULL);
            for (int i = 0; i < mbi.RegionSize; i++)
            {
                if (DataCompare(buffer + i, sign, mask))
                {
                    delete[] buffer;
                    return (uintptr_t)mbi.BaseAddress + i;
                }
            }

            delete[] buffer;
        }
        offset += mbi.RegionSize;
    }
    return 0;
}

uintptr_t Module(const char* ModuleName)
{
    HANDLE hModule = CreateToolhelp32Snapshot(TH32CS_SNAPMODULE, PID);
    MODULEENTRY32 mEntry;
    mEntry.dwSize = sizeof(mEntry);

    do
        if (!strcmp(mEntry.szModule, ModuleName))
        {
            CloseHandle(hModule);
            return (uintptr_t)mEntry.modBaseAddr;
        }
    while (Module32Next(hModule, &mEntry));

    return 0;
}

uintptr_t ModuleSize(const char* ModuleName)
{
    HANDLE hModule = CreateToolhelp32Snapshot(TH32CS_SNAPMODULE, PID);
    MODULEENTRY32 mEntry;
    mEntry.dwSize = sizeof(mEntry);

    do
        if (!strcmp(mEntry.szModule, ModuleName))
        {
            CloseHandle(hModule);
            return (uintptr_t)mEntry.modBaseSize;
        }
    while (Module32Next(hModule, &mEntry));

    return 0;
}

DWORD GetModuleSize(char* pModuleName)
{
    HMODULE hModule = GetModuleHandle(pModuleName);

    if (!hModule)
        return 0;

    PIMAGE_DOS_HEADER       pImage_Dos_Header = PIMAGE_DOS_HEADER(hModule);
    PIMAGE_NT_HEADERS       pImage_PE_Header = PIMAGE_NT_HEADERS(long(hModule) + pImage_Dos_Header->e_lfanew);
    PIMAGE_OPTIONAL_HEADER pImage_Optional_Header = &pImage_PE_Header->OptionalHeader;

    return pImage_Optional_Header->SizeOfCode;
}

template <class T>
T Read(LPVOID ptr) {
    T out;
    ReadProcessMemoryCallback(hProcess, ptr, &out, sizeof(T), NULL);
    return out;
}
template <class T>
void ReadTo(LPVOID ptr,T* out,int len) {
    ReadProcessMemoryCallback(hProcess, ptr, out, len, NULL);
}
ULONG_PTR ReadInt(LPVOID ptr) {
    return Read<ULONG_PTR>(ptr);
}

template< class T > struct TArray
{
public:
    T* Data;
    int Count;
    int Max;

public:
    TArray()
    {
        Data = NULL;
        Count = Max = 0;
    };

public:
    int Num()
    {
        return this->Count;
    };

    T& operator() (int i)
    {
        return this->Data[i];
    };

    const T& operator() (int i) const
    {
        return this->Data[i];
    };

    void Add(T InputData)
    {
        Data = (T*)realloc(Data, sizeof(T) * (Count + 1));
        Data[Count++] = InputData;
        Max = Count;
    };

    void Clear()
    {
        free(Data);
        Count = Max = 0;
    };
};

struct FName
{
    int				Index;
    unsigned char	unknownData00[0x4];
};

struct FString : public TArray< wchar_t > {

};
#include <vector>
class FUObjectItem
{
public:
    ULONG_PTR Object; //0x0000
    __int32 Flags; //0x0008
    __int32 ClusterIndex; //0x000C
    __int32 SerialNumber; //0x0010
    __int32 pad; //0x0010
};

class TUObjectArray
{
public:
    FUObjectItem* Objects;
    int32_t MaxElements;
    int32_t NumElements;
};

class FUObjectArray
{
public:
    __int32 ObjFirstGCIndex; //0x0000
    __int32 ObjLastNonGCIndex; //0x0004
    __int32 MaxObjectsNotConsideredByGC; //0x0008
    __int32 OpenForDisregardForGC; //0x000C

    TUObjectArray ObjObjects; //0x0010
};
class CObjects {
    
public:
    static int32_t GetCount() {
        auto ptr = Read<int32_t>((PBYTE)GObjects + offsetof(TUObjectArray, NumElements));
        return ptr;
    }
    static ULONG_PTR GetObject(int id) {
       // auto ptr = Read<ULONG_PTR>((PBYTE)GObjects + offsetof(FUObjectArray, ObjObjects));
        return Read<ULONG_PTR>(((PBYTE)GObjects + (id * sizeof(FUObjectItem))));
    }
}; 


class CNames {
public:
    static int GetChunkCount() {
        return Read<int>((PBYTE)GNames + 0x404);
    }
    static const char* GetName(int id) {
        static char m_name[124];
        auto pData = Read<ULONG_PTR>((PBYTE)GNames + int(id / 0x4000) * 8);
        LPBYTE pEntry = Read<LPBYTE>(((PBYTE)(pData + 8 * int(id % 0x4000))));
        ZeroMemory(m_name, sizeof(m_name));
        ReadProcessMemory(hProcess, (LPCVOID)(pEntry + 0x10), (uint8_t*)m_name, sizeof(m_name) - 2, NULL) != 0;
        return m_name; 
    }
};
class AActor {
public:
    ULONG_PTR _this;
    AActor(ULONG_PTR ptr) : _this(ptr) {
    }
    int GetId() {
        return Read<int>((LPBYTE)_this + 0x18);
    }
    const char* GetName() {
        return CNames::GetName(GetId());//"name";
    }
};

#pragma pack(push,1)
struct encryptedActor
{
	uint64_t ptr_table[0x2B];
	uint16_t index;
	byte  unk2[0x6];
	uint16_t xor;
	byte  unk3[0x6];
};
#pragma pack(pop)
class CWorld : public AActor{
public:
    CWorld(ULONG_PTR ptr) : AActor(ptr) {
    }
	std::vector<AActor> GetActors() {
        std::vector<AActor> v;
        TArray<ULONG_PTR> levels = Read<TArray<ULONG_PTR>>((LPBYTE)_this + 0x150);
        for (int i = 0; i < levels.Count; i++) {
            ULONG_PTR ptr = Read<ULONG_PTR>((LPBYTE)levels.Data + (i * 8));
            if (ptr) {
                TArray<ULONG_PTR> buf = Read<TArray<ULONG_PTR>>((LPBYTE)ptr + 0xA0);
                for (int i = 0; i < buf.Count; i++) {
                    ULONG_PTR ptr2 = Read<ULONG_PTR>((LPBYTE)buf.Data + (i * 8));
                    if (ptr2)
                        v.push_back(AActor(ptr2));
                }
            }
        }
		//get level and list actors
		return v;
	};
};

void InitPubG() {
    HWND hWndGame;
    DWORD dwProcessId;
    while (NULL == (hWndGame = GetPUBGWindowProcessId(&dwProcessId)))
    {
        MessageBoxA(0, "please start pubg", "please start pubg", 0);
        ExitProcess(0);
        Sleep(100);
    }
    MessageBoxA(0, "Init pubg", "Init pubg", 0);
}

enum WND_MENU {
    FILTER_STATIC,
    FILTER_LABEL,
    FILTER_BUTTON,
    PTR_STATIC,
    PTR_LABEL,
    PTR_BUTTON,
    SCAN_LISTBOX,
    SCAN_LISTVIEW,
    STATUS_STATIC,
};
bool bFinish = false;
HINSTANCE hInstance;

#define SCREEN_WIDTH  1000
#define SCREEN_HEIGHT 600
HWND hWnd;
HWND hEdit1;
HWND hEdit2;
HWND hStatic;
HWND hListBox;
HWND hListView;
LRESULT CALLBACK WindowProc(HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam);
#define SET_STATUS(x) SetWindowText(hStatic,  x)



// https://stackoverflow.com/a/47978023/15495138
static std::string random_string()
{
    std::string str("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz");

    std::random_device rd;
    std::mt19937 generator(rd());

    std::shuffle(str.begin(), str.end(), generator);

    return str.substr(0, 32);    // assumes 32 < number of characters in str         
}

static HWND showWindow()
{
    INITCOMMONCONTROLSEX icex;           // Structure for control initialization.
    icex.dwICC = ICC_LISTVIEW_CLASSES;
    InitCommonControlsEx(&icex);

    const char *wndClass = "wndclass";
    WNDCLASSEX wc;
    ZeroMemory(&wc, sizeof(WNDCLASSEX));
    wc.cbSize = sizeof(WNDCLASSEX);
    //wc.style = CS_DBLCLKS | CS_GLOBALCLASS;// CS_HREDRAW | CS_VREDRAW | CS_DBLCLKS;
    wc.lpfnWndProc = WindowProc;
    wc.lpszClassName = wndClass;
    wc.hInstance = hInstance;//GetModuleHandle(nullptr);
    //wc.hCursor = LoadCursor(nullptr, IDC_ARROW);
    wc.hbrBackground = (HBRUSH)(COLOR_WINDOW);//(HBRUSH)GetStockObject(BLACK_BRUSH);//reinterpret_cast<HBRUSH>(COLOR_WINDOW);
    //wc.lpszClassName = wndClass;
    RegisterClassEx(&wc);
    RECT wr = { 0, 0, SCREEN_WIDTH, SCREEN_HEIGHT };
    AdjustWindowRect(&wr, WS_OVERLAPPEDWINDOW, FALSE);
    unsigned int dwStyle = ( WS_CAPTION | WS_SYSMENU | WS_MINIMIZEBOX);
    hWnd = CreateWindowEx(NULL, wndClass, random_string().c_str(), dwStyle, 300, 300, wr.right - wr.left, wr.bottom - wr.top, nullptr, nullptr, GetModuleHandle(nullptr), nullptr);

    hStatic = CreateWindowEx(0, WC_STATICA, NULL,
        WS_CHILD | WS_VISIBLE,
        20, 500, 680, 32,
        hWnd, (HMENU)STATUS_STATIC, hInstance, NULL);
    SetWindowText(hStatic, "Status: ");
    SendMessage(hStatic, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);

    HWND hStatic3 = CreateWindowEx(0, WC_STATICA, NULL,
        WS_CHILD | WS_VISIBLE,
        20, 380, 280, 32,
        hWnd, (HMENU)FILTER_STATIC, hInstance, NULL);
    SetWindowText(hStatic3, "Filter:");
    SendMessage(hStatic3, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);
    hEdit1 = CreateWindowEx(0, WC_EDITA, NULL,
        WS_CHILD | WS_VISIBLE,
        60, 380, 100, 24,
        hWnd, (HMENU)FILTER_LABEL, hInstance, NULL);
    SendMessage(hEdit1, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);


    HWND hSearch = CreateWindowEx(0, WC_BUTTONA, NULL,
        WS_CHILD | WS_VISIBLE,
        180, 380, 62, 22,
        hWnd, (HMENU)FILTER_BUTTON, hInstance, NULL);
    SetWindowText(hSearch, "SCAN");
    SendMessage(hSearch, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);

    //x

    HWND hStatic2 = CreateWindowEx(0, WC_STATICA, NULL,
        WS_CHILD | WS_VISIBLE,
        20, 420, 280, 32,
        hWnd, (HMENU)PTR_STATIC, hInstance, NULL);
    SetWindowText(hStatic2, "Pointer:");
    SendMessage(hStatic2, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);
    hEdit2 = CreateWindowEx(0, WC_EDITA, NULL,
        WS_CHILD | WS_VISIBLE,
        60, 420, 100, 24,
        hWnd, (HMENU)PTR_LABEL, hInstance, NULL);
    SendMessage(hEdit2, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);


    HWND hSearch2 = CreateWindowEx(0, WC_BUTTONA, NULL,
        WS_CHILD | WS_VISIBLE,
        180, 420, 62, 22,
        hWnd, (HMENU)PTR_BUTTON, hInstance, NULL);
    SetWindowText(hSearch2, "PTR SCAN");
    SendMessage(hSearch2, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);


    hListBox = CreateWindowEx(0, WC_LISTBOXA, NULL,
        WS_CHILD | WS_VISIBLE | WS_VSCROLL | LBS_NOTIFY ,
        10, 10, 260, 360,
        hWnd, (HMENU)SCAN_LISTBOX, hInstance, NULL);
    SendMessage(hListBox, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);

    hListView = CreateWindowEx(0, WC_LISTVIEWA, NULL,
        WS_CHILD | WS_VISIBLE | WS_VSCROLL | LVS_REPORT | LVS_ALIGNLEFT | UDS_ALIGNRIGHT | LVS_ALIGNTOP,
        380, 10, 560, 460,
        hWnd, (HMENU)SCAN_LISTVIEW, hInstance, NULL);
    SendMessage(hListView, WM_SETFONT, WPARAM(GetStockObject(DEFAULT_GUI_FONT)), TRUE);
    SendMessage(hListView, LVM_SETEXTENDEDLISTVIEWSTYLE,
        0, LVS_EX_FULLROWSELECT); // Set style
    LVCOLUMN LvCol;
    // Here we put the info on the Coulom headers
    // this is not data, only name of each header we like
    memset(&LvCol, 0, sizeof(LvCol));                  // Zero Members

    LvCol.mask = LVCF_TEXT | LVCF_WIDTH | LVCF_SUBITEM;    // Type of mask
    LvCol.cx = 0x28;                                   // width between each coloum
    LvCol.pszText = "Offset";                            // First Header Text
    LvCol.cx = 0x32;                                   // width of column
                                                       // Inserting Couloms as much as we want
    SendMessage(hListView, LVM_INSERTCOLUMN, 0, (LPARAM)&LvCol); // Insert/Show the coloum
    LvCol.pszText = "Name";                            // Next coloum
    LvCol.cx = 0x132;                                   // width of column
    SendMessage(hListView, LVM_INSERTCOLUMN, 1, (LPARAM)&LvCol); // ...
    LvCol.pszText = "Value";                            //
    LvCol.cx = 0x132;                                   // width of column
    SendMessage(hListView, LVM_INSERTCOLUMN, 2, (LPARAM)&LvCol); //
    //draw listview and tableview
    
    ShowWindow(hWnd, SW_SHOWNORMAL);
    return hWnd;
}
#include <vector>
#include <string>
#include <Shlwapi.h>
#pragma comment(lib,"Shlwapi.lib")
//reference https://puu.sh/nvF9d/04c184dfec.png

struct FPointer
{
    ULONG_PTR Dummy;
};
struct FQWord
{
    int A;
    int B;
};
class UClass;
class UObject
{
public:
    FPointer VTableObject;
    int32_t ObjectFlags;
    int32_t InternalIndex;
    UClass* Class;
    FName Name;
    UObject* Outer;
};
class UField : public UObject
{
public:
    UField* Next;
};
template<typename KeyType, typename ValueType>
class TPair
{
public:
    KeyType   Key;
    ValueType Value;
};

class UEnum : public UField
{
public:
    FString CppType; //0x0030 
    TArray<TPair<FName, uint32_t>> Names; //0x0040
    __int64 CppForm; //0x0050
    char pad_0x0058[0x8]; //0x0058
};

class UStruct : public UField
{
public:
    UStruct* SuperField;
    UField* Children;
    int PropertySize;
    int MinAlignment;
    TArray<uint8_t> Script;
    class UProperty* PropertyLink;
    class UProperty* RefLink;
    class UProperty* DestructorLink;
    class UProperty* PostConstructLink;
    TArray<UObject*> ScriptObjectReferences;
};
class UProperty : public UField
{
	using UField::UField;
public:
    int ArrayDim;
    int ElementSize;
    uint64_t PropertyFlags;
    char pad[0xC];
    int Offset_Internal;
    UProperty* PropertyLinkNext;
    UProperty* NextRef;
    UProperty* DestructorLinkNext;
    UProperty* PostConstructLinkNext;
};
class UFunction : public UStruct
{
public:
    int FunctionFlags;
    uint16_t RepOffset;
    uint8_t NumParms;
    char pad;
    uint16_t ParmsSize;
    uint16_t ReturnValueOffset;
    uint16_t RPCId;
    uint16_t RPCResponseId;
    UProperty* FirstPropertyToInit;
    UFunction* EventGraphFunction; //0x00A0
    int EventGraphCallOffset;
    char pad_0x00AC[0x4]; //0x00AC
    void* Func; //0x00B0
};
class UScriptStruct : public UStruct
{
public:
    char pad_0x0088[0x10]; //0x0088
};

class UClass : public UStruct
{
public:
    unsigned char UnknownData00[0x138];                                     // 0x0088(0x0138) MISSED OFFSET
};

class UBoolProperty : public UProperty
{
public:
    unsigned long		BitMask;									// 0x0088 (0x04)
};
class UArrayProperty : public UProperty
{
public:
    UProperty* Inner;
};
class UMapProperty : public UProperty
{
public:
    UProperty* KeyProp;
    UProperty* ValueProp;
};
class UStructProperty : public UProperty
{
public:
    UScriptStruct* Struct;
};
template<class T>
class UProxy {
public:
    ULONG_PTR ptr;
    T obj;
    UProxy(ULONG_PTR _ptr) : ptr(_ptr) {
        ReadTo((LPBYTE)_ptr, &obj, sizeof(obj));
    }
    T* GetObject() {
        return &obj;
    }
    int GetId() {
        return obj.Name.Index;
    }
    std::string GetName() {
        return CNames::GetName(GetId());
    }
    bool IsA(UClass* pClass)
    {
        /*for (UClass* SuperClass = this->Class; SuperClass; SuperClass = (UClass*)SuperClass->SuperField)
        {
            if (SuperClass == pClass)
                return true;
        }*/

        return false;
    }
    template <class T>
    T As() {
        return T(ptr);
    }
